"""[TASK] STASH."""

# 1. Что делает команда git stash?
# Помещает незакоммиченные изменения во временное хранилище (стэш)
#
# 2. Как просмотреть список всех сохранённых изменений (стэшей)?
# git stash list
#
# 3. Какая команда применяется для использования верхнего стэша?
# git stash apply
#
# 4. Как применить конкретный стэш по его номеру?
# git stash apply stash@{N}
#
# 5. Чем отличается команда git stash apply от git stash pop?
# git stash apply применяет стэш и он остается в списке
# git stash pop применяет стэш и удаляет его из списка
#
# 6. Что делает команда git stash drop?
# Удаляет стэш из списка без применения
#
# 7. Как полностью очистить все сохранённые стэши?
# git stash clear
#
# 8. В каких случаях удобно использовать git stash?
# Когда нужно принять пулл с репозитория или перейти в другую ветку, а в
# проекте есть незакоммиченные изменения
#
# 9. Что произойдёт, если выполнить git stash pop, но в проекте есть
# конфликтующие изменения?
# Конфликт нужно будет разрешить вручную, стэш из списка не удалится
#
# 10. Можно ли восстановить удалённый стэш после выполнения git stash drop?
# Можно восстановить пока в гите не прошла "сборка мусора"
#
# 11. Что делает команда git stash save "NAME_STASH"
# Сохраняет стэш под именем "NAME_STASH".
# Команда устарела, вместо неё используется git stash push -m "NAME_STASH"
#
# 12. Что делает команда git stash apply "NUMBER_STASH"
# Применяет стэш с указанным номером, стэш остаётся в списке.
# Стэш указывается в формате stash@{N}, например git stash apply stash@{1}
#
# 13. Что делает команда git stash pop "NUMBER_STASH"
# Применяет стэш с указанным номером и удаляет его из списка.
# Стэш указывается в формате stash@{N}, например git stash pop stash@{1}
#
# 14. Сохраните текущие изменения в стэш под названием "SENATOROV ver1",
# вставьте скриншот из терминала
# git stash push -m "SENATOROV ver1"
#
# ![stash_14](images/stash_14.png)
#
# 15. Внесите любые изменения в ваш репозиторий и сохраните второй стэш под
# именем "SENATOROV ver2"
# git stash push -m "SENATOROV ver2"
# git stash list
#
# ![stash_15](images/stash_15.png)
#
# 16. Восстановите ваш стэш "SENATOROV ver1", вставьте скриншот из терминала
# git stash apply stash@{1}
#
# ![stash_16](images/stash_16.png)
#
# 17. Удалите все стеши из истории, вставьте скриншот из терминала
# git stash clear
# git stash list
#
# ![stash_17](images/stash_17.png)
